<a href="https://colab.research.google.com/github/91ns/AI-Community/blob/master/Data_Preparation_Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Data Preparation Basics

##Filtering and selecting data

[Pandas](https://www.tutorialspoint.com/python_pandas/index.htm) is an open-source Python library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

[NumPy](https://www.tutorialspoint.com/numpy/index.htm), which stands for Numerical Python, is a library consisting of multidimensional array objects and a collection of routines for processing those arrays.


[Series](https://www.tutorialspoint.com/python_pandas/python_pandas_series.htm) is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index.

A [Data frame](https://www.tutorialspoint.com/python_pandas/python_pandas_dataframe.htm) is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

In [0]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

### Selecting and retrieving data
You can write an index value in two forms.
- Label index or 
- Integer index

In [0]:
#numpy.arange([start, ]stop, [step, ]dtype=None)
#Return evenly spaced values within a given interval.

arr_1 = np.arange(3)

print(arr_1)

[0 1 2]

In [0]:
arr_2 = np.arange(3,7)

print(arr_2)

[3 4 5 6]

In [0]:
arr_3 = np.arange(3,7,2)

print(arr_3)

[3 5]

In [0]:
series_obj = Series(np.arange(10), index=['row 1', 'row 2', 'row 3', 'row 4', 'row 5', 'row 6','row 7', 'row 8', 'row 9', 'row 10'])

print(series_obj)

row 1     0
row 2     1
row 3     2
row 4     3
row 5     4
row 6     5
row 7     6
row 8     7
row 9     8
row 10    9
dtype: int64

In [0]:
series_obj['row 9']

8

In [0]:
series_obj['row 11']

KeyError: ignored

In [0]:
series_obj[[0, 7, 9]]

row 1     0
row 8     7
row 10    9
dtype: int64

In [0]:
series_obj[np.arange(0,10,2)]

row 1    0
row 3    2
row 5    4
row 7    6
row 9    8
dtype: int64

In [0]:
np.random.seed(1)

#m_1 = np.random.rand(36).reshape((6,6))
m_1 = np.random.randint(0, 10, 36).reshape((6,6))

DF_obj = DataFrame(m_1,
                   #index=['row 1', 'row 2', 'row 3', 'row 4','row 5','row 6'],
                   index=[np.arange(6)],
                   columns=['column 1','column 2','column 3','column 4','column 5','column 6'])
DF_obj

   column 1  column 2  column 3  column 4  column 5  column 6
0         5         8         9         5         0         0
1         1         7         6         9         2         4
2         5         2         4         2         4         7
3         7         9         1         7         0         6
4         9         9         7         6         9         1
5         0         1         8         8         3         9

In [0]:
DF_obj.loc[[0,1], ['column 5', 'column 2']]

   column 5  column 2
0  0.146756  0.720324
1  0.419195  0.345561

### Data slicing

In [0]:
print(series_obj)

row 1     0
row 2     1
row 3     2
row 4     3
row 5     4
row 6     5
row 7     6
row 8     7
row 9     8
row 10    9
dtype: int64

In [0]:
series_obj['row 3': 'row 7']

row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
dtype: int64

In [0]:
series_obj['row 3':]

row 3     2
row 4     3
row 5     4
row 6     5
row 7     6
row 8     7
row 9     8
row 10    9
dtype: int64

In [0]:
series_obj[:'row 5']

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
dtype: int64

### Comparing with scalars



![alt text](https://iconicdevelopers.com/wp-content/uploads/2019/01/Overview-of-Comparison-Operators-in-Python-1024x603.png)

In [0]:
DF_obj < .2

   column 1  column 2  column 3  column 4  column 5  column 6
0     False     False      True     False      True      True
1      True     False     False     False     False     False
2     False     False      True     False     False     False
3      True      True     False     False     False     False
4     False     False      True      True      True     False
5      True     False     False     False     False     False

In [0]:
DF_obj[DF_obj < .2]

   column 1  column 2  column 3  column 4  column 5  column 6
0       NaN       NaN  0.000114       NaN  0.146756  0.092339
1  0.186260       NaN       NaN       NaN       NaN       NaN
2       NaN       NaN  0.027388       NaN       NaN       NaN
3  0.140387  0.198101       NaN       NaN       NaN       NaN
4       NaN       NaN  0.085044  0.039055  0.169830       NaN
5  0.098347       NaN       NaN       NaN       NaN       NaN

### Filtering with scalars

In [0]:
series_obj[series_obj > 6]

row 8     7
row 9     8
row 10    9
dtype: int64

### Setting values with scalars

In [0]:
series_obj['row 1', 'row 5', 'row 8'] = 8

series_obj

row 1     8
row 2     1
row 3     2
row 4     3
row 5     8
row 6     5
row 7     6
row 8     8
row 9     8
row 10    9
dtype: int64

##Treating Missing Data

In [0]:
missing = np.nan

series_obj = Series(['row 1', 'row 2', missing, 'row 4', 'row 5', 'row 6', missing, 'row 8'])
series_obj

0    row 1
1    row 2
2      NaN
3    row 4
4    row 5
5    row 6
6      NaN
7    row 8
dtype: object

### Figuring out what data is missing

In [0]:
# (NaN) Not a Number 

missing = np.nan

series_obj = Series(['row 1', 'row 2', missing, 'row 4', 'row 5', 'row 6', missing, 'row 8'])

series_obj

0    row 1
1    row 2
2      NaN
3    row 4
4    row 5
5    row 6
6      NaN
7    row 8
dtype: object

In [0]:
series_obj.isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
dtype: bool

### Filling in for missing values

In [0]:
np.random.seed(25)

DF_obj = DataFrame(np.random.rand(36).reshape(6,6))

DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
3  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
4  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
5  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [0]:
DF_obj.loc[3:5, 0] = missing
DF_obj.loc[1:4, 5] = missing
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366       NaN
2  0.447031  0.585445  0.161985  0.520719  0.326051       NaN
3       NaN  0.836375  0.481343  0.516502  0.383048       NaN
4       NaN  0.559053  0.034450  0.719930  0.421004       NaN
5       NaN  0.900274  0.669612  0.456069  0.289804  0.525819

In [0]:
filled_DF = DF_obj.fillna(0)
filled_DF

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.000000
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.000000
3  0.000000  0.836375  0.481343  0.516502  0.383048  0.000000
4  0.000000  0.559053  0.034450  0.719930  0.421004  0.000000
5  0.000000  0.900274  0.669612  0.456069  0.289804  0.525819

In [0]:
filled_DF = DF_obj.fillna({0: 0.1, 5:1.25})
filled_DF

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  1.250000
2  0.447031  0.585445  0.161985  0.520719  0.326051  1.250000
3  0.100000  0.836375  0.481343  0.516502  0.383048  1.250000
4  0.100000  0.559053  0.034450  0.719930  0.421004  1.250000
5  0.100000  0.900274  0.669612  0.456069  0.289804  0.525819

In [0]:
fill_DF = DF_obj.fillna(method='ffill')
fill_DF

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.117376
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.117376
3  0.447031  0.836375  0.481343  0.516502  0.383048  0.117376
4  0.447031  0.559053  0.034450  0.719930  0.421004  0.117376
5  0.447031  0.900274  0.669612  0.456069  0.289804  0.525819

### Counting missing values

Generate a summary of how much data is missing in each column

In [0]:
np.random.seed(25)
DF_obj = DataFrame(np.random.rand(36).reshape(6,6))
DF_obj.loc[3:5, 0] = missing
DF_obj.loc[1:4, 5] = missing
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366       NaN
2  0.447031  0.585445  0.161985  0.520719  0.326051       NaN
3       NaN  0.836375  0.481343  0.516502  0.383048       NaN
4       NaN  0.559053  0.034450  0.719930  0.421004       NaN
5       NaN  0.900274  0.669612  0.456069  0.289804  0.525819

In [0]:
DF_obj.isnull().sum()

0    3
1    0
2    0
3    0
4    0
5    4
dtype: int64

### Filtering out missing values

Remove the missing data

In [0]:
DF_no_NaN = DF_obj.dropna()
DF_no_NaN

          0         1         2         3       4         5
0  0.870124  0.582277  0.278839  0.185911  0.4111  0.117376

In [0]:
DF_no_NaN = DF_obj.dropna(axis=1)
DF_no_NaN

          1         2         3         4
0  0.582277  0.278839  0.185911  0.411100
1  0.437611  0.556229  0.367080  0.402366
2  0.585445  0.161985  0.520719  0.326051
3  0.836375  0.481343  0.516502  0.383048
4  0.559053  0.034450  0.719930  0.421004
5  0.900274  0.669612  0.456069  0.289804

### Removing duplicates

Find out if we have duplicate data and remove it

In [16]:
DF_obj= DataFrame({'column 1':[1,1,2,2,3,3,3],
                   'column 2':['a', 'a','b', 'b', 'c', 'c', 'c'],
                   'column 3':['A', 'A', 'B', 'B', 'C', 'C', 'C']})
DF_obj

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [17]:
DF_obj.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [18]:
DF_obj.drop_duplicates()

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C

In [19]:
DF_obj= DataFrame({'column 1':[1,1,2,2,3,3,3],
                   'column 2':['a', 'a','b', 'b', 'c', 'c', 'c'],
                   'column 3':['A', 'A', 'B', 'B', 'C', 'D', 'C']})
DF_obj

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        D
6         3        c        C

In [20]:
DF_obj.drop_duplicates(['column 3'])

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C
5         3        c        D

##Concatenating and transforming data

In [21]:
DF_obj = pd.DataFrame(np.arange(36).reshape(6,6))
DF_obj

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [22]:
DF_obj_2 = pd.DataFrame(np.arange(15).reshape(5,3))
DF_obj_2

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

### Concatenating data

Combining two DataFrame objects together

In [23]:
pd.concat([DF_obj, DF_obj_2], axis=1)

    0   1   2   3   4   5     0     1     2
0   0   1   2   3   4   5   0.0   1.0   2.0
1   6   7   8   9  10  11   3.0   4.0   5.0
2  12  13  14  15  16  17   6.0   7.0   8.0
3  18  19  20  21  22  23   9.0  10.0  11.0
4  24  25  26  27  28  29  12.0  13.0  14.0
5  30  31  32  33  34  35   NaN   NaN   NaN

In [24]:
pd.concat([DF_obj, DF_obj_2])

    0   1   2     3     4     5
0   0   1   2   3.0   4.0   5.0
1   6   7   8   9.0  10.0  11.0
2  12  13  14  15.0  16.0  17.0
3  18  19  20  21.0  22.0  23.0
4  24  25  26  27.0  28.0  29.0
5  30  31  32  33.0  34.0  35.0
0   0   1   2   NaN   NaN   NaN
1   3   4   5   NaN   NaN   NaN
2   6   7   8   NaN   NaN   NaN
3   9  10  11   NaN   NaN   NaN
4  12  13  14   NaN   NaN   NaN

### Transforming data
#### Dropping data

In [27]:
DF_obj

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [30]:
DF_obj.drop([0, 2], axis=0)

    0   1   2   3   4   5
1   6   7   8   9  10  11
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [29]:
DF_obj.drop([0, 2], axis=1)

    1   3   4   5
0   1   3   4   5
1   7   9  10  11
2  13  15  16  17
3  19  21  22  23
4  25  27  28  29
5  31  33  34  35

### Adding data

In [37]:
series_obj = Series(['failed','failed','passed','passed','passed','passed'])
series_obj.name = "label"
series_obj

0    failed
1    failed
2    passed
3    passed
4    passed
5    passed
Name: label, dtype: object

In [42]:
#Adding a list of labels to the DataFrame

labels_added = DataFrame.join(DF_obj, series_obj)
labels_added

    0   1   2   3   4   5   label
0   0   1   2   3   4   5  failed
1   6   7   8   9  10  11  failed
2  12  13  14  15  16  17  passed
3  18  19  20  21  22  23  passed
4  24  25  26  27  28  29  passed
5  30  31  32  33  34  35  passed

In [40]:
labels_added = labels_added.append(labels_added, ignore_index=False)
labels_added

    0   1   2   3   4   5   label
0   0   1   2   3   4   5  failed
1   6   7   8   9  10  11  failed
2  12  13  14  15  16  17  passed
3  18  19  20  21  22  23  passed
4  24  25  26  27  28  29  passed
5  30  31  32  33  34  35  passed
0   0   1   2   3   4   5  failed
1   6   7   8   9  10  11  failed
2  12  13  14  15  16  17  passed
3  18  19  20  21  22  23  passed
4  24  25  26  27  28  29  passed
5  30  31  32  33  34  35  passed

In [43]:
added_datatable = labels_added.append(labels_added, ignore_index=True)
added_datatable

     0   1   2   3   4   5   label
0    0   1   2   3   4   5  failed
1    6   7   8   9  10  11  failed
2   12  13  14  15  16  17  passed
3   18  19  20  21  22  23  passed
4   24  25  26  27  28  29  passed
5   30  31  32  33  34  35  passed
6    0   1   2   3   4   5  failed
7    6   7   8   9  10  11  failed
8   12  13  14  15  16  17  passed
9   18  19  20  21  22  23  passed
10  24  25  26  27  28  29  passed
11  30  31  32  33  34  35  passed

### Sorting data

In [52]:
#DF_sorted = added_datatable.sort_values(by='label', ascending=[False])
DF_sorted = added_datatable.sort_values(by=(2), ascending=[True])

DF_sorted

     0   1   2   3   4   5   label
0    0   1   2   3   4   5  failed
6    0   1   2   3   4   5  failed
1    6   7   8   9  10  11  failed
7    6   7   8   9  10  11  failed
2   12  13  14  15  16  17  passed
8   12  13  14  15  16  17  passed
3   18  19  20  21  22  23  passed
9   18  19  20  21  22  23  passed
4   24  25  26  27  28  29  passed
10  24  25  26  27  28  29  passed
5   30  31  32  33  34  35  passed
11  30  31  32  33  34  35  passed

### Grouping data by column index

In [0]:
from google.colab import drive
drive.mount('/content/drive')

In [55]:
address = '/content/drive/My Drive/mtcars.csv'

cars = pd.read_csv(address)

cars.columns = ['car_names', 'mpg', 'cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs', 'am', 'gear', 'carb']
cars.head()

           car_names   mpg  cyl   disp   hp  ...   qsec  vs  am  gear  carb
0          Mazda RX4  21.0    6  160.0  110  ...  16.46   0   1     4     4
1      Mazda RX4 Wag  21.0    6  160.0  110  ...  17.02   0   1     4     4
2         Datsun 710  22.8    4  108.0   93  ...  18.61   1   1     4     1
3     Hornet 4 Drive  21.4    6  258.0  110  ...  19.44   1   0     3     1
4  Hornet Sportabout  18.7    8  360.0  175  ...  17.02   0   0     3     2

[5 rows x 12 columns]

In [64]:
cars.count()

car_names    32
mpg          32
cyl          32
disp         32
hp           32
drat         32
wt           32
qsec         32
vs           32
am           32
gear         32
carb         32
dtype: int64

In [65]:
cars.mean()

mpg      20.090625
cyl       6.187500
disp    230.721875
hp      146.687500
drat      3.596563
wt        3.217250
qsec     17.848750
vs        0.437500
am        0.406250
gear      3.687500
carb      2.812500
dtype: float64

In [68]:
grouped_by_gear = cars.groupby(cars['gear'])

grouped_by_gear.mean()

            mpg       cyl        disp  ...        vs        am      carb
gear                                   ...
3     16.106667  7.466667  326.300000  ...  0.200000  0.000000  2.666667
4     24.533333  4.666667  123.016667  ...  0.833333  0.666667  2.333333
5     21.380000  6.000000  202.480000  ...  0.200000  1.000000  4.400000

[3 rows x 10 columns]

In [69]:
grouped_by_cyl = cars.groupby(cars['cyl'])

grouped_by_cyl.mean()

           mpg        disp          hp  ...        am      gear      carb
cyl                                     ...
4    26.663636  105.136364   82.636364  ...  0.727273  4.090909  1.545455
6    19.742857  183.314286  122.285714  ...  0.428571  3.857143  3.428571
8    15.100000  353.100000  209.214286  ...  0.142857  3.285714  3.500000

[3 rows x 10 columns]